; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v1 ?v10)
             (pred_4 ?v11 ?v7)
             (pred_7 ?v1 ?v7)
             (pred_9 ?v12 ?v1 )
	     (pred_3 ?v1)
             (pred_8 ?v9)
             (pred_2 ?v11)
             (pred_6 ?v7)
             (pred_11 ?v1)
             (pred_12 ?v11)
             (pred_1 ?v1)
             (pred_5 ))



(:action op_4
:parameters (?v8 ?v3 ?v6 ?v4)
:precondition (and (pred_8 ?v8) (pred_8 ?v3) (pred_2 ?v6) (pred_6 ?v4)
          (pred_10 ?v8 ?v3) (pred_4 ?v6 ?v4)
                   (pred_7 ?v3 ?v4) (pred_3 ?v8) 
                   (pred_11 ?v3) (pred_12 ?v6))
:effect (and  (pred_1 ?v3) (not (pred_11 ?v3))))


(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_8 ?v8) (pred_8 ?v2)
               (pred_3 ?v8) (pred_10 ?v8 ?v2) (pred_1 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v8))))

(:action op_2
:parameters (?v8 ?v6)
:precondition (and (pred_8 ?v8) (pred_2 ?v6) 
                  (pred_3 ?v8) (pred_9 ?v6 ?v8) (pred_5 ))
:effect (and (pred_12 ?v6)
   (not (pred_9 ?v6 ?v8)) (not (pred_5 ))))


(:action op_5
:parameters (?v8 ?v13 ?v5)
:precondition (and (pred_8 ?v8) (pred_2 ?v13) (pred_2 ?v5)
                  (pred_3 ?v8) (pred_12 ?v5) (pred_9 ?v13 ?v8))
:effect (and (pred_12 ?v13) (pred_9 ?v5 ?v8)
        (not (pred_12 ?v5)) (not (pred_9 ?v13 ?v8))))

(:action op_3
:parameters (?v8 ?v6)
:precondition (and (pred_8 ?v8) (pred_2 ?v6) 
                  (pred_3 ?v8) (pred_12 ?v6))
:effect (and (pred_5 ) (pred_9 ?v6 ?v8) (not (pred_12 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_12 obj_15 obj_13 obj_08 obj_16 obj_04 obj_20 obj_11 obj_09 obj_06 obj_17 obj_14 obj_07 obj_10 obj_18
    obj_19 obj_01
    obj_05 obj_03
    )

    (:init
       (pred_5)

       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_20)
       (pred_8 obj_11)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_14)
       (pred_8 obj_07)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_6 obj_19)
       (pred_6 obj_01)
       (pred_2 obj_05)
       (pred_2 obj_03)

       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_09 obj_07)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_07 obj_09)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_7  obj_02 obj_19)
       (pred_7  obj_09 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_08)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_11)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_14)
       (pred_1 obj_07)
       (pred_1 obj_10)
       (pred_1 obj_18)

       (pred_4  obj_05 obj_19)
       (pred_4  obj_03 obj_01)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_03 obj_20)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_9 obj_05 obj_14)
       (pred_9 obj_03 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_1 obj_10 obj_18)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_18)
   goals met: 0 of 2
2. (op_2 obj_18 obj_05)
   deleted: (pred_9 obj_05 obj_18) (pred_5)
   added: (pred_12 obj_05)
   goals met: 0 of 2
3. (op_1 obj_18 obj_10)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_10)
   goals met: 0 of 2
4. (op_1 obj_10 obj_07)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_07)
   goals met: 0 of 2
5. (op_1 obj_07 obj_14)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_14)
   goals met: 0 of 2
6. (op_3 obj_14 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_5) (pred_9 obj_05 obj_14)
   goals met: 1 of 2
7. (op_1 obj_14 obj_07)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_07)
   goals met: 1 of 2
8. (op_1 obj_07 obj_10)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_10)
   goals met: 1 of 2
9. (op_1 obj_10 obj_06)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_06)
   goals met: 1 of 2
10. (op_1 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 1 of 2
11. (op_1 obj_04 obj_20)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_20)
   goals met: 1 of 2
12. (op_2 obj_20 obj_03)
   deleted: (pred_9 obj_03 obj_20) (pred_5)
   added: (pred_12 obj_03)
   goals met: 1 of 2
13. (op_1 obj_20 obj_04)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_04)
   goals met: 1 of 2
14. (op_1 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 1 of 2
15. (op_4 obj_06 obj_09 obj_03 obj_01)
   deleted: (pred_11 obj_09)
   added: (pred_1 obj_09)
   goals met: 1 of 2
16. (op_1 obj_06 obj_09)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_09)
   goals met: 1 of 2
17. (op_1 obj_09 obj_11)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_11)
   goals met: 1 of 2
18. (op_3 obj_11 obj_03)
   deleted: (pred_12 obj_03)
   added: (pred_5) (pred_9 obj_03 obj_11)
   goals met: 2 of 2
